const MORSE_TABLE = {
  ".-": "a",
  "-...": "b",
  "-.-.": "c",
  "-..": "d",
  ".": "e",
  "..-.": "f",
  "--.": "g",
  "....": "h",
  "..": "i",
  ".---": "j",
  "-.-": "k",
  ".-..": "l",
  "--": "m",
  "-.": "n",
  "---": "o",
  ".--.": "p",
  "--.-": "q",
  ".-.": "r",
  "...": "s",
  "-": "t",
  "..-": "u",
  "...-": "v",
  ".--": "w",
  "-..-": "x",
  "-.--": "y",
  "--..": "z",
  ".----": "1",
  "..---": "2",
  "...--": "3",
  "....-": "4",
  ".....": "5",
  "-....": "6",
  "--...": "7",
  "---..": "8",
  "----.": "9",
  "-----": "0",
};

function decode(expr) {
  // Разделили строку на массив из строк по 10 символов
  let exprArr = expr.match(/.{1,10}/g);
  // Строка с тире и точками
  let morseStr = [];

  // Заменили 10 на '.'; 11 на '-' и '*******' на '';
  for (let i = 0; i < exprArr.length; i++) {
    morseStr.push(
      exprArr[i]
        .replace(/00/g, "")
        .replace(/10/g, ".")
        .replace(/11/g, "-")
        .replace(/[*]/g, "")
    );
  }

  let result = "";
  // Заменяем тире о точки на буквы
  morseStr.map((elem) => {
    elem === "" ? (result += " ") : (result += MORSE_TABLE[elem]);
  });
  return result;
}

module.exports = {
  decode,
};
